INSERT INTO categories (id, name, weight)
VALUES (1, 'Языки программирования', 1.30),
       (2, 'Фреймворки и библиотеки', 1.30),
       (3, 'Инструменты и технологии', 1.15),
       (4, 'Облачные технологии и DevOps', 1.15),
       (5, 'Базы данных', 1.15),
       (6, 'Направления в IT', 1.30),
       (7, 'Машинное обучение и Data analysis', 1.30),
       (8, 'Изучение и развитие', 1.30),
       (9, 'Образ жизни', 1.00),
       (10, 'Хобби и творчество', 1.00),
       (11, 'Игры и развлечения', 0.75),
       (12, 'Бизнес и карьера', 1.30)
ON CONFLICT (id) DO NOTHING;

UPDATE skills s
SET weight = ROUND(s.weight / (c.weight * 100))
FROM categories c
WHERE s.category_id = c.id;

INSERT INTO skills (category_id, name, weight)
VALUES (1, 'Python', 1.00),
       (1, 'Java', 1.00),
       (1, 'JavaScript', 1.00),
       (1, 'C++', 0.85),
       (1, 'C#', 0.85),
       (1, 'Go', 0.85),
       (1, 'Rust', 0.85),
       (1, 'Kotlin', 0.70),
       (1, 'Swift', 0.70),
       (1, 'Lua', 0.55),
       (1, 'Bash', 0.55),
       (1, 'PHP', 0.55),
       (1, 'Rubby', 0.55),
       (1, 'Perl', 0.55),
       (1, 'Assembler', 0.55),


       (2, 'Spring', 1.00),
       (2, 'FastAPI', 1.00),
       (2, 'Django', 1.00),
       (2, 'React', 1.00),
       (2, 'Next.js', 0.85),
       (2, 'Flask', 0.85),
       (2, 'Vue', 0.85),
       (2, 'PyTorch', 0.85),
       (2, 'TensorFlow', 0.85),
       (2, 'Transformers', 0.70),

       (3, 'Git', 1.00),
       (3, 'Docker', 1.00),
       (3, 'Linux', 1.00),
       (3, 'Kubernetes', 0.85),
       (3, 'CI/CD', 0.85),
       (3, 'Nginx', 0.70),
       (3, 'Kafka', 0.70),

       (4, 'AWS', 1.00),
       (4, 'GCP', 0.85),
       (4, 'Azure', 0.85),
       (4, 'Yandex Cloud', 1.00),
       (4, 'GitLab', 0.95),
       (4, 'Terraform', 0.95),
       (4, 'Ansible', 0.70),
       (4, 'Prometheus', 0.70),

       (5, 'PostgresSQL', 1.00),
       (5, 'MySQL', 1.00),
       (5, 'MongoDB', 1.00),
       (5, 'Redis', 0.85),
       (5, 'ClickHouse', 1.00),
       (5, 'ElasticSearch', 0.85),
       (5, 'Redis', 0.85),
       (5, 'Qdrant', 0.85),
       (5, 'Oracle', 0.85),

       (6, 'Backend', 1.00),
       (6, 'Frontend', 1.00),
       (6, 'Fullstack', 1.00),
       (6, 'DevOps', 1.00),
       (6, 'Data Engineer', 1.00),
       (6, 'QA', 1.00),
       (6, 'Mobile', 1.00),
       (6, 'Security & Cybersecurity', 1.00),
       (6, 'Game Development', 1.00),
       (6, 'Blockchain', 1.00),
       (6, 'AR/VR разработка', 1.00),
       (6, 'Product Management', 1.00),
       (6, 'Project Management', 1.00),
       (6, 'Product/UX/UI Design', 1.00),
       (6, 'Микроконтроллеры', 0.80),

       (7, 'Machine Learning', 1.00),
       (7, 'Deep Learning', 1.00),
       (7, 'Computer Vision', 0.85),
       (7, 'NLP', 0.85),
       (7, 'Data Science', 0.85),
       (7, 'MLOps', 0.70),
       (7, 'SQL', 1.00),

       (8, 'Алгоритмы и структуры данных', 1.00),
       (8, 'Спортивное программирование', 1.00),
       (8, 'Инвестиции', 1.00),
       (8, 'Математика', 1.00),
       (8, 'Наука', 1.00),
       (8, 'Иностранные языки', 1.00),
       (8, 'Психология', 1.00),
       (8, 'Маркетинг', 1.00),
       (8, 'Богословие', 0.70),

       (9, 'Спорт', 1.00),
       (9, 'Бег', 0.85),
       (9, 'Тренажерный зал', 0.85),
       (9, 'Йога', 0.70),
       (9, 'Боевые искусства', 0.85),
       (9, 'Активные виды спорта', 0.85),
       (9, 'Медитация', 0.70),

       (10, 'Танцы', 1.00),
       (10, 'Фильмы и сериалы', 1.00),
       (10, 'Чтение', 1.00),
       (10, 'Музыка', 1.00),
       (10, 'Вокал', 1.00),
       (10, 'Фотография', 1.00),
       (10, 'Рисование', 1.00),
       (10, 'Походы', 1.00),
       (10, 'Путешествия', 1.00),
       (10, 'Создание контента', 1.00),

       (11, 'Шахматы', 1.00),
       (11, 'Компьютерные игры', 1.00),
       (11, 'Настольные игры', 0.85),
       (11, 'Киберспорт', 0.85),

       (12, 'Фаундер (кофаундер) стартапа', 1.00),
       (12, 'Фриланс', 0.85),
       (12, 'Менеджмент', 0.85),
       (12, 'Публичные выступления', 0.70),
       (12, 'Личное развитие', 0.70)

ON CONFLICT (name) DO NOTHING;

UPDATE skills s
SET weight = ROUND(s.weight * c.weight * 100)
FROM categories c
WHERE s.category_id = c.id;